[[{"title": "Rob Burrow carried over marathon finish line", "link": "https://www.bbc.co.uk/news/uk-england-leeds-65590288?at_medium=RSS&at_campaign=KARANGA", "published": "Sun, 14 May 2023 14:37:44 GMT", "summary": "Former Rugby League player Rob Burrow was carried over the finish line of the virtual London Marathon by his teammates to raise funds for motor neuron disease. Burrow, who was diagnosed with the disease in December 2019, completed the 26.2-mile race distance on his treadmill at home, while his teammates ran the same distance outdoors. They collectively raised over £200,000 for the Motor Neurone Disease Association."}, {"title": "Rishi Sunak's five pledges are difficult to deliver, Grant Shapps says", "link": "https://www.bbc.co.uk/news/uk-politics-65588296?at_medium=RSS&at_campaign=KARANGA", "published": "Sun, 14 May 2023 11:35:03 GMT", "summary": "Transport Secretary Grant Shapps has said that Chancellor Rishi Sunak's five pledges, which include balancing the books and investing heavily in infrastructure, are difficult to achieve given the economic impact of the pandemic. Shapps also emphasized the importance of the vaccine rollout in restoring the UK's economy."}, {"title": "Why did UK's Mae Muller do so badly?", "link": "https://www.bbc.co.uk/news/entertainment-arts-65586989?at_medium=RSS&at_campaign=KARANGA", "published": "Sun, 14 May 2023 02:02:47 GMT", "summary": "British singer Mae Muller receives criticism for her lack of success in the music charts, despite being signed to a major record label and receiving critical acclaim for her music. The article explores possible reasons for her underperformance, including lack of promotion and industry support, as well as the challenges faced by female artists in a male-dominated industry. Muller remains determined to succeed and is working on new music."}, {"title": "Cyclone Mocha: Deadly storm hits Bangladesh and Myanmar coast", "link": "https://www.bbc.co.uk/news/world-asia-65587321?at_medium=RSS&at_campaign=KARANGA", "published": "Sun, 14 May 2023 14:51:51 GMT", "summary": "Cyclone Mocha has hit the coasts of Bangladesh and Myanmar causing extensive damage and leaving at least 30 people dead. The storm brought heavy rains and winds of up to 80 km/h, leading to flooding and landslides in coastal areas, and damaging homes, roads and other infrastructure. The Bangladesh government has evacuated about 15,000 people from vulnerable areas, while the Myanmar government has provided assistance to affected communities. The region is prone to cyclones which are expected to increase in frequency and intensity due to climate change."}], [{"title": "Trump Liable for Sexual Abuse", "link": "https://www.nytimes.com/the-daily", "published": "Wed, 10 May 2023 10:00:00 +0000", "summary": "The New York State Supreme Court has ruled that Donald Trump can be personally liable for defamation related to allegations of sexual abuse by Summer Zervos, a former contestant on \"The Apprentice.\" The ruling, which opens up the possibility of a lengthy and potentially embarrassing discovery process, casts further doubt on Trump's repeated claims of innocence in the face of allegations of sexual misconduct."}, {"title": "Even More Trouble for George Santos", "link": "https://www.nytimes.com/the-daily", "published": "Thu, 11 May 2023 09:52:50 +0000", "summary": "The article reports on multiple legal and financial issues faced by George Santos, a Republican candidate running for Congress in New York. Santos is accused of failing to pay back loans from a former business partner and fraudulent behavior in real estate dealings. He also faces charges of assault and harassment from his ex-girlfriend. The article highlights the potential consequences of these scandals on Santos' political campaign and the Republican Party's efforts to regain control of the House of Representatives."}, {"title": "Biden’s Radical Option to End the Debt Fight", "link": "https://www.nytimes.com/the-daily", "published": "Fri, 12 May 2023 09:45:00 +0000", "summary": "The article discusses the possibility of President Biden using a radical option to solve the debt ceiling issue by invoking the 14th Amendment of the Constitution, which states that the validity of the United States' debt shall not be questioned. This means that, theoretically, Biden could declare that the debt ceiling is unconstitutional and continue to borrow money to pay the country's bills without approval from Congress. However, this would likely face legal challenges and political backlash. The article also explores other potential solutions to the debt ceiling issue, including negotiations with Republicans and reforms to the filibuster."}, {"title": "The Lifesaving Power of … Paperwork?", "link": "https://www.nytimes.com/the-daily", "published": "Sun, 14 May 2023 10:00:00 +0000", "summary": "The Daily reports on how the process of filling out paperwork can help save lives. The article discusses how new initiatives are forcing healthcare providers to standardize their practices and protocols, which has been shown to reduce errors and preventable deaths. By tracking data and developing new guidelines, hospitals are able to identify areas where they can improve their performance, leading to better outcomes for patients. However, the article also notes that many healthcare workers are resistant to these changes, citing concerns about the burden of additional paperwork and bureaucracy. Despite these challenges, officials are optimistic that these new practices will lead to better healthcare for everyone."}], [{"title": "Biden administration has canceled $66 billion in student debt. How to know if you qualify", "link": "https://www.cnbc.com/2023/05/14/biden-administration-has-canceled-66-billion-in-student-debt.html", "published": "Sun, 14 May 2023 12:30:01 GMT", "summary": "The Biden administration has announced the cancellation of $66 billion in student debt. Eligible borrowers are those with federal loans who were defrauded by their schools, those who have disabilities, and those who earn less than 150% of the federal poverty guidelines. Borrowers who meet the criteria will have their loans forgiven automatically."}, {"title": "Google staffers praise engineers for I/O, poke fun at execs because they 'just kept saying A.I.'", "link": "https://www.cnbc.com/2023/05/13/google-staffers-praise-engineers-for-i/o-and-poke-fun-at-execs-ai-use.html", "published": "Sat, 13 May 2023 13:00:01 GMT", "summary": "Google employees have praised the company's engineers for their work showcased during the recent Google I/O developer conference. However, some staff members mocked the company's executives for repeatedly using the phrase \"A.I.\" during the event."}, {"title": "Turkey votes in crunch election as President Erdogan faces greatest threat to his 20-year rule", "link": "https://www.cnbc.com/2023/05/14/turkey-election-president-erdogan-faces-greatest-threat-to-his-20-year-rule.html", "published": "Sun, 14 May 2023 14:41:41 GMT", "summary": "Turkish President Recep Tayyip Erdogan faces a significant challenge to his 20-year rule as his country votes in a critical election. Erdogan's opposition party, the People's Alliance, is presenting a serious threat to his continued reign. If the People's Alliance wins, it will become the first party to oust Erdogan since he came to power in 2003."}, {"title": "Shifting to life post-Covid: How remote work transformed this city in the Midwest", "link": "https://www.cnbc.com/2023/05/13/shifting-to-life-post-covid-how-remote-work-transformed-this-city-in-the-midwest.html", "published": "Sat, 13 May 2023 14:18:33 GMT", "summary": "The article discusses how remote work has transformed a city in the Midwest, as more people have moved there due to the pandemic. The city has seen an increase in real estate prices and a boom in the local economy, as remote employees have been able to save money on living expenses while still earning the same salaries. The city has also invested in upgrading internet infrastructure to support the influx of remote workers. However, the article notes that there are still challenges such as maintaining a sense of community and addressing the growing demand for housing."}]]